Revit 2027 API
Transform.Inverse Property
The inverse transformation of this transformation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform Inverse { get; }
Public ReadOnly Property Inverse As Transform
	Get
public:
property Transform^ Inverse {
	Transform^ get ();
}
member Inverse : Transform with get
Property Value
Transform
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when this transformation is not conformal or invertible.
Remarks
 The transformation matrix A is invertible if there exists a transformation matrix B such that A*B = B*A = I (identity).
See Also
Reference
Transform Class
Autodesk.Revit.DB Namespace